{"pageProps":{"attributes":{"title":"My Story","image":"/static/images/my-story.jpg","homepage description":"I help purpose-driven entrepreneurial brands and media organizations invent and translate new ideas into viable digital products that are engaging, inspire action, and have a positive social impact."},"body":"## At twelve, I lived through a revolution. Here’s the story.\n\n---\n\nMy grandparents were diplomats and political activists. Their open criticism of the communist regime landed them under house arrest in the 1980s. The secret police tapped our phones, hung outside the house, and sometimes shadowed me to school. \n\nThe revolution followed the fall of the Berlin Wall. The tides were turning in Eastern Europe and my house was no exception. One night, I lay in the hallway with my family, shots snapping on the street. A bullet zoomed past my head and drilled the wall behind me. Mom whispered, We’re not going to make it. But we did. In the morning, I retrieved that bullet. It was massive.\n\n## So you could say we're a family of renegades. We moved to the U.S. as refugees and were luckier than most. I didn’t speak a lick of English and sensed that a new world had just opened up to me.\n\n---\n\nArt and design became my way of navigating life. It got me through learning a new language and adapting to a new culture. It connected me with non-conformists who explored the edges. It gave me purpose and helped pay the rent when I didn’t have a solid roadmap. And eventually, it landed me a role at a boutique agency in lower Manhattan. This happens to a shy kid from Bucharest? Yes, yes it does.\n\nI led product design at e.l.f. Cosmetics, a start-up ran by a lean group of entrepreneurs. We came from all walks of life and made luxurious, high-quality beauty products available to everyone. Here, I cut my teeth on all things digital. We launched enhancements quickly and often, with a bias for customer feedback in real time. I helped invent a beauty subscription program, designed the first mobile site, relaunched to responsive, created content, and built an inhouse photo studio. e.l.f. attracted investment, expanded globally, and has since gone public.\n\n## I used my instinct to build/connect/invent deliberately to help unite colleagues and stimulate growth. I learned that a default to openness, experimentation, cross-functional teaming, and autonomy is a model of working that leads to greater leaps than we could imagine as individual contributors.\n\n---\n\nMy approach is to enable designers do their best work ever—by bringing a steadying hand, creating space for discovery, and uniting individual purpose with that of the larger organization. The early life experience of displacement has imprinted me with an irresistible drive to chart new territory and create meaningful connection for and between people. \n\nWhat motivates me is the journey of building something tangible and impactful from an idea. And when that product brings about positive social change, it fulfills me deeply. This is my life’s purpose. Design is the means through which I exercise it. I’ve made it my professional practice to explore towards breakthroughs that give life to the big idea."},"__N_SSG":true}